{
	"name": "c05",
	"authors":
		{
		"Mohsen Azimi": {"affiliation":0,
						"website":"https://mohsen-azimi.github.io/",
						"email":"mohsen.azimi@ubc.ca"},
		"Sina Tavasoli": {"affiliation":0,
						"website":"#",
						"email":"#"},
		"Kasra Jabbari": {"affiliation":1,
						"website":"#",
						"email":"#"},

		"Tony Yang": {"affiliation":0,
					"website":"https://civil.ubc.ca/tony-yang/",
					"email":"yang@civil.ubc.ca"}
		},
	"affiliations": ["Department of Civil Engineering, The University of British Columbia, Vancouver, British Columbia, Canada",
		"Department of Electrical Engineering, Iran University of Science and Technology, Tehran, Iran"],
	"title": "Integrated Robotics System For Autonomous Mapping And 3D Scene Reconstruction In Structural Health Monitoring Applications",
	"journal": "Canadian Conference - Pacific Conference on Earthquake Engineering 2023, Vancouver, British Columbia",
	"doi": "#",
	"url": "#",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "This paper presents a novel integrated unmanned aerial vehicle (UAV) and unmanned ground vehicle (UGV) system for structural health monitoring (SHM). In the aftermath of a disaster, efficient and accurate data collection and processing is crucial for assessing the structural integrity of buildings. However, current limitations in SHM systems include a lack of autonomy, leading to manual remote operations that are labor-intensive and time-consuming. To address that, the proposed system utilizes a wireless robot operating system (ROS) network to coordinate navigation and data collection of the UAV and UGV. Additionally, improved simultaneous localization and mapping (SLAM) algorithm is employed to generate a 2D map of the environment. High-resolution data collected by the UAV is used for 3D reconstruction at the scene and component level, making it suitable for post-earthquake assessments. The effectiveness of the proposed system was validated through experiments using a custom-built ground robot and a micro aerial vehicle for indoor inspections. Results from both qualitative and quantitative analyses demonstrate the potential for this system to enhance the efficiency and effectiveness of post-earthquake SHM and remote sensing through the use of cost-effective and portable robots.",
	"year": "2023"
}

