{
	"name": "c06",
	"authors":
		{
		"Mohsen Azimi": {"affiliation":0,
						"website":"https://mohsen-azimi.github.io/",
						"email":"mohsen.azimi@ubc.ca"},
		"Armin Dadras Eslamlou": {"affiliation":1,
						"website":"#",
						"email":"#"},

		"Tony Yang": {"affiliation":0,
					"website":"https://civil.ubc.ca/tony-yang/",
					"email":"yang@civil.ubc.ca"},
		"Shiping Huang": {"affiliation":1,
						"website":"#",
						"email":"#"}
		},
	"affiliations": ["Department of Civil Engineering, The University of British Columbia, Vancouver, British Columbia, Canada",
		"School of Civil Engineering and Transportation, South China University of Technology, Guangzhou, China"],
	"title": "Remote Sensing And Machine Learning For Enhanced Post-Disaster Response: Insights From The 2023 Türkiye–Syria Earthquake",
	"journal": "Canadian Conference - Pacific Conference on Earthquake Engineering 2023, Vancouver, British Columbia",
	"doi": "#",
	"url": "#",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "The 2023 Türkiye–Syria earthquake caused widespread devastation with thousands of fatalities. This study aims to investigate the potential of remote-sensing methods in improving post-disaster response efforts, by leveraging advanced technologies such as satellite and aerial imagery with geospatial data, computer vision, and machine learning. These techniques include change detection through satellite image analysis, regional damage assessment, optimal path planning for multiple unmanned aerial vehicles (UAVs), and 3D reconstruction for local damage assessment. The findings of this study highlight the importance of incorporating data science and machine learning into disaster response planning, which can lead to an improved and more efficient allocation of resources, rapid decision-making in crises, and a more effective overall response. The insights generated by this study can inform the development of new disaster management strategies and the design of advanced data science tools, leading to better outcomes for communities affected by natural disasters.",
	"year": "2023"
}
