{
	"name": "j04",
	"authors":
		{
		"Mohsen Azimi": {"affiliation":0,
					"website":" ",
					"email":" "},
		"Akbar Rasoulnia": {"affiliation":1,
					"website":" ",
					"email":" "},
		"Zhibin Lin": {"affiliation":0,
					"website":" ",
					"email":" "},
		"Hong Pan": {"affiliation":0,
						"website":" ",
						"email":" "}
		},
	"affiliations": ["Department of Civil and Environmental Engineering, North Dakota State University, Fargo, North Dakota, 58105 USA", "Department of Civil Engineering, Sharif University of Technology, Tehran, Iran"],
	"title": "Improved semi‐active control algorithm for hydraulic damper‐based braced buildings",
	"journal": "Structural Control and Health Monitoring ",
	"doi": " https://doi.org/10.1002/stc.1991",
	"url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/stc.1991",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "Much research has been conducted on structural control systems to improve the seismic performance of structures under earthquakes and, ultimately, offer high performance-resilient buildings beyond life risk mitigation. Among various structural control algorithms, semi-active control strategies have been widely accepted for overcoming some limitations existed in either passive or active control systems, thereby leading to better structural performance over their counterparts. In this study, a new semi-active control algorithm with minimum control parameters is developed to drive the hydraulic damper for effective control of the dynamic deformation of low- and high-rise building structures under earthquake loadings. The new controller allows less input and computation for determining the damping coefficient of the hydraulic dampers while maintaining a higher performance. V-braced buildings with three varying heights are used as prototypes to demonstrate the effectiveness of the proposed semi-active damper. Two critical parameters, maximum drift and acceleration of stories, are defined for the performance criteria. The simulation results show that the developed semi-active damper can significantly improve the seismic performance of the buildings in terms of controlled story drift and acceleration. By use of less input and reduced time delay effects, the proposed control system is comparable with those of existing semi-active controllers. The findings in this study will help engineers to design control systems for seismic risk mitigation and effectively facilitate the performance-based seismic design.",
	"year": "2017"
}

