{
	"name": "c07",
	"authors":
		{
		"Sina Tavasoli": {"affiliation":0,
			"website":"#",
			"email":"#"},

		"SXiao Pan": {"affiliation":0,
						"website":"#",
						"email":"#"},
		"Tony Yang": {"affiliation":0,
					"website":"https://civil.ubc.ca/tony-yang/",
					"email":"yang@civil.ubc.ca"},
		"Saudah Gazi": {"affiliation":0,
					"website":"#",
					"email":"#"},

		"Mohsen Azimi": {"affiliation":0,
						"website":"https://mohsen-azimi.github.io/",
						"email":"mohsen.azimi@ubc.ca"}


		},
	"affiliations": ["Department of Civil Engineering, The University of British Columbia, Vancouver, British Columbia, Canada"],
	"title": "Autonomous damage assessment of structural columns using low-cost micro aerial vehicles and multi-view computer vision",
	"journal": "Canadian Conference - Pacific Conference on Earthquake Engineering 2023, Vancouver, British Columbia",
	"doi": "#",
	"url": "#",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "Structural columns are the crucial load-carrying components of buildings and bridges. Early detection of column damage is important for the assessment of the residual performance and the prevention of system-level collapse. This research proposes an innovative end-to-end micro aerial vehicles (MAVs)-based approach to automatically scan and inspect columns. First, an MAV-based automatic image collection method is proposed. The MAV is programmed to sense the structural columns and their surrounding environment. During the navigation, the MAV first detects and approaches the structural columns. Then, it starts to collect image data at multiple viewpoints around every detected column. Second, the collected images will be used to assess the damage types and damage locations. Third, the damage state of the structural column will be determined by fusing the evaluation outcomes from multiple camera views. In this study, reinforced concrete (RC) columns are selected to demonstrate the effectiveness of the approach. Experimental results indicate that the proposed MAV-based inspection approach can effectively collect images from multiple viewing angles, and accurately assess critical RC column damages. The approach improves the level of autonomy during the inspection. In addition, the evaluation outcomes are more comprehensive than the existing 2D vision methods. The concept of the proposed inspection approach can be extended to other structural columns such as bridge piers.",
	"year": "2023"
}
