{
	"name": "C03",
	"title": "Vibration-Based Support Vector Machine for Structural Health Monitoring",

	"authors":
		{
		"Hong Pan": {"affiliation":0,
						"website":" ",
						"email":" "},
		"Mohsen Azimi": {"affiliation":0,
						"website":"https://mohsen-azimi.github.io/",
						"email":"#"},
		"Guoqing Gui": {"affiliation":1,
						"website":" ",
						"email":" "},

		"Fei Yan": {"affiliation":0,
					"website":" ",
					"email":" "},
		"Zhibin Lin": {"affiliation":0,
					"website":" ",
					"email":" "}
		},
	"affiliations": ["Department of Civil and Environmental Engineering, North Dakota State University, Fargo, ND, USA", "School of Architecture and Civil Engineering, Jinggangshan University, Ji’an, 343009, Jiangxi, China"],
	"journal": "Experimental Vibration Analysis for Civil Structures: Testing, Sensing, Monitoring, and Control",
	"doi": "https://doi.org/10.1007/978-3-319-67443-8_14",
	"url": "https://link.springer.com/chapter/10.1007/978-3-319-67443-8_14",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "There are ever-increasing interests to determine effectively structural diagnosis and conditional assessment for structural health monitoring (SHM). Although research has been extensively conducted in the conventional physical-based vibration analysis, advancement in sensor technologies and complexity in structural systems post great challenges in the effectiveness of these techniques. Alternatively, various data-driven based machine learning techniques are recently emerging tools to data clarification. In this study, a new vibration-based machine learning was proposed for condition assessment and damage detection in SHM. Three vibration-based feature extraction methods, autoregressive, vector autoregressive and singular value decomposition methods, were used as damage sensitive features. A kernel function based support vector machine was used to facilitate the identification between damaged and undamaged cases. A benchmark with varying environment and operational conditions in the literature was selected to verify the effectiveness of the proposed methods. The results showed that three feature methods could effectively map damage features in a high dimensional feature space, thereby dramatically improving the effectiveness and accuracy of data classification. Moreover, comparisons of results revealed that the singular value decomposition methods exhibit higher sensitivity to damage states as compared to other two approaches.",
	"year": "2017"
}

