{
	"name": "c04",
	"authors":
		{
		"Mohsen Azimi": {"affiliation":0,
						"website":" ",
						"email":" "},
		"Hong Pan": {"affiliation":0,
					"website":" ",
					"email":" "},
		"Mehdi Abdeddaim": {"affiliation":1,
					"website":" ",
					"email":" "},
		"Zhibin Lin": {"affiliation":0,
					"website":" ",
					"email":" "}
		},
	"affiliations": ["Department of Civil and Environmental Engineering, North Dakota State University, Fargo, ND, USA", "Department of Civil Engineering and Hydraulics, Mohamed Khider University, Biskra, Algeria"],
	"title": "Optimal design of active tuned mass dampers for mitigating translational--torsional motion of irregular buildings",
	"journal": "Experimental Vibration Analysis for Civil Structures: Testing, Sensing, Monitoring, and Control",
	"doi": "https://doi.org/10.1007/978-3-319-67443-8_51",
	"url": "https://link.springer.com/chapter/10.1007/978-3-319-67443-8_51",
	"code_url": "#",
	"supplementary_url": "#",
	"abstract": "The active tuned mass dampers (ATMDs) are accepted as effective energy dissipating devices to effectively reduce structural dynamic response when subjected to seismic loads. The conventional design of these devices, however, may not be applicable to high-rise buildings with irregularity in plan and elevation, where significant torsional motions could be dominant during a strong earthquake. This study is to develop a new approach using the ATMD for reducing the torsional motion as well as resisting the lateral translational displacements. Three actuators are used to apply the control forces to the twin-TMD system in two directions, while the optimal control forces were determined using linear quadratic regulator (LQR) algorithm. In addition, instead of using two independent mass dampers in two directions, a single damper system was used to minimize the displacements and rotation simultaneously. To demonstrate the performance of the system, the final design was applied to an irregular ten-story building subjected to near- and far-field earthquakes. The results indicate that the proposed design approach is more cost effective as compared to the design with independent pairs of dampers in two directions. Further, the system exhibits higher reliability under different ground accelerations in two directions than conventional ones.",
	"year": "2024"
}

